Samraksh/eMote/MicroFrameworkPK_v4_3/DeviceCode/Targets/Native/STM32F10x/DeviceCode/drivers/radio/SI4468/si4468_driver.cpp
static si446x_tx_callback_t tx_callback;
static si446x_rx_callback_t rx_callback;

static HAL_CONTINUATION tx_callback_continuation;
static HAL_CONTINUATION rx_callback_continuation;
static HAL_CONTINUATION int_defer_continuation;

static unsigned isInit = 0;
static int si446x_channel = 0;
static unsigned tx_power = 0;
static volatile UINT64 rx_timestamp;

//volatile bool softwareACKSent;

// Radio PAL stuff
static Radio<Message_15_4_t> radio_si446x_spi2;
static UINT16 active_mac_index; // For some reason this is tied to HAL ... suspect should be in PAL object
static Message_15_4_t tx_msg; // SI_DUMMY message to handle stupid PAL. FIX ME.
static Message_15_4_t* tx_msg_ptr;
static Message_15_4_t rx_msg;
static Message_15_4_t* rx_msg_ptr;
// END RADIO PALL STUFF

// In case we had to defer interrupt handling for any reason...
static void int_cont_do(void *arg) {
	si446x_debug_print(DEBUG01,"SI446X: int_cont_do()\r\n");
	SI446x_INT_MODE_CHECK();
	si446x_spi2_handle_interrupt( SI446X_pin_setup.nirq_mf_pin, false, NULL );
}

static void sendSoftwareAck(UINT16 dest){
	CPU_GPIO_SetPinState(DATARX_SEND_SW_ACK, TRUE);
	si446x_debug_print(DEBUG02,"SI446X: sendSoftwareAck\r\n");
	static int i = 0;
	static softwareACKHeader softwareAckHeader;
	if(i == 0){
		softwareAckHeader.src = radio_si446x_spi2.GetAddress();
		softwareAckHeader.payloadType = MFM_OMAC_DATA_ACK;
		i++;
	}
	softwareAckHeader.dest = dest;
	si446x_packet_send(si446x_channel, (uint8_t *) &softwareAckHeader, sizeof(softwareACKHeader), 0, NO_TIMESTAMP, SI446x_TX_ACK_DONE_STATE);
	//softwareACKSent = true;
	CPU_GPIO_SetPinState(DATARX_SEND_SW_ACK, FALSE);
}

// I agree its questionable that I'm being too complicated with continuation stuff... --NPS.
// TX CALLBACK
static void tx_cont_do(void *arg) {
	CPU_GPIO_SetPinState( SI4468_HANDLE_INTERRUPT_TX, FALSE );
	if (tx_callback != NULL)
		tx_callback();

	SI446x_INT_MODE_CHECK();

	si446x_debug_print(DEBUG02,"SI446X: tx_cont_do()\r\n");

	SendAckFuncPtrType AckHandler = radio_si446x_spi2.GetMacHandler(active_mac_index)->GetSendAckHandler();
	(*AckHandler)(tx_msg_ptr, si446x_packet_size, NetworkOperations_Success, SI_DUMMY);

	// only unlock if TX was the source. Could overlap with RX, which overrides.
	si446x_radio_lock_if_then_nofail(radio_lock_tx, radio_lock_none);
	CPU_GPIO_SetPinState( SI4468_HANDLE_INTERRUPT_TX, TRUE );
}

// Returns true if a continuation is linked and needs service.
static bool cont_busy(void) {
	return (tx_callback_continuation.IsLinked() || rx_callback_continuation.IsLinked() || int_defer_continuation.IsLinked());
}

static void rx_cont_do(void *arg) {
	//CPU_GPIO_SetPinState( SI4468_HANDLE_INTERRUPT_RX, FALSE );
	CPU_GPIO_SetPinState( SI4468_MEASURE_RX_TIME, TRUE );
	uint8_t rx_pkt[si446x_packet_size];
	int size;
	radio_lock_id_t owner;
	uint8_t rssi;

	si446x_debug_print(DEBUG01,"SI446X: rx_cont_do()\r\n");

	SI446x_INT_MODE_CHECK();

	if ( owner = si446x_spi_lock(radio_lock_rx) ) {
		si446x_debug_print(DEBUG02,"SI446X: rx_cont_do(): Radio busy, SPI: %s\r\n", print_lock(owner));
		rx_callback_continuation.Enqueue();
		return;
	}

	// For fun, double check to make sure RX holds the radio lock.
	if ( (owner = si446x_radio_lock(radio_lock_rx)) != radio_lock_rx ) {
		si446x_debug_print(ERR99,"SI446X: rx_cont_do(): Warning. RX without RX lock, owner was %s\r\n", print_lock(owner));
	}

	si446x_request_device_state(); // Don't need here, but want to refresh internal state.
	size = si446x_get_packet_info(0,0,0);
	if(size == sizeof(softwareACKHeader)){
		si446x_read_rx_fifo(size, rx_pkt);

		si446x_fifo_info(0x3); // Defensively reset FIFO
		si446x_radio_unlock();
		si446x_spi_unlock();

		memcpy( (uint8_t *)rx_msg_ptr, rx_pkt, size );
		rx_msg_ptr = (Message_15_4_t *) (radio_si446x_spi2.GetMacHandler(active_mac_index)->GetReceiveHandler())(rx_msg_ptr, size);

		//CPU_GPIO_SetPinState( SI4468_HANDLE_INTERRUPT_RX, TRUE );
		CPU_GPIO_SetPinState( SI4468_MEASURE_RX_TIME, FALSE );
		return;
	}

	si446x_read_rx_fifo(size, rx_pkt);

	if (rx_callback != NULL)
		rx_callback(rx_timestamp, size, rx_pkt);

	si446x_get_modem_status( 0xFF ); // Refresh RSSI

	rssi = si446x_get_latched_rssi();

	si446x_fifo_info(0x3); // Defensively reset FIFO
	si446x_change_state(SI_STATE_SLEEP); // All done, sleep.

	finisher_queued = false;
	si446x_radio_unlock();
	si446x_spi_unlock();

	if (rx_msg_ptr == NULL) return; // Nothing left to do.

	// Metadata struct
	IEEE802_15_4_Metadata_t* metadata = rx_msg_ptr->GetMetaData();

	// Copy packet to MAC packet
	memcpy( (uint8_t *)rx_msg_ptr, rx_pkt, size );

	// Set Metadata
	metadata->SetRssi( rssi );
	metadata->SetLqi(0);  // No meaning on this radio
	metadata->SetReceiveTimeStamp((INT64)rx_timestamp);

	IEEE802_15_4_Header_t* header = rx_msg_ptr->GetHeader();
	int currentPayloadType = header->payloadType;

	//Send ack from radio itself.
	if(__SI4468_SOFTWARE_ACK__){
		if(currentPayloadType == MFM_OMAC_TIMESYNCREQ || currentPayloadType == MFM_DATA || currentPayloadType <= TYPE31){
			if(currentPayloadType == MFM_DATA){
				si446x_debug_print(DEBUG02, "rx_cont_do; sendSoftwareAck to %d; currentPayloadType: %d\n", header->src, currentPayloadType);
			}
			sendSoftwareAck(header->src);
		}
	}

	// I guess this swaps rx_msg_ptr as well???
	//(rx_msg_ptr->GetHeader())->SetLength(size);
	header->length = size; // the "new" way. blarg.

	rx_msg_ptr = (Message_15_4_t *) (radio_si446x_spi2.GetMacHandler(active_mac_index)->GetReceiveHandler())(rx_msg_ptr, header->length);

	//CPU_GPIO_SetPinState( SI4468_HANDLE_INTERRUPT_RX, TRUE );
	CPU_GPIO_SetPinState( SI4468_MEASURE_RX_TIME, FALSE );
}

void si446x_hal_register_tx_callback(si446x_tx_callback_t callback) {
	tx_callback = callback;
}

void si446x_hal_unregister_tx_callback() {
	tx_callback = NULL;
}

void si446x_hal_register_rx_callback(si446x_rx_callback_t callback) {
	rx_callback = callback;
}

void si446x_hal_unregister_rx_callback() {
	rx_callback = NULL;
}
// END RX CALLBACK

// This somehow gets put in the radio function. Out of scope for now, but fix me later.
static void GetCPUSerial(uint8_t * ptr, unsigned num_of_bytes ){
	unsigned Device_Serial0;unsigned Device_Serial1; unsigned Device_Serial2;
	Device_Serial0 = *(unsigned*)(0x1FFFF7E8);
	Device_Serial1 = *(unsigned*)(0x1FFFF7EC);
	Device_Serial2 = *(unsigned*)(0x1FFFF7F0);
	if(num_of_bytes==12){
	    ptr[0] = (uint8_t)(Device_Serial0 & 0x000000FF);
	    ptr[1] = (uint8_t)((Device_Serial0 & 0x0000FF00) >> 8);
	    ptr[2] = (uint8_t)((Device_Serial0 & 0x00FF0000) >> 16);
	    ptr[3] = (uint8_t)((Device_Serial0 & 0xFF000000) >> 24);

