Samraksh/eMote/MicroFrameworkPK_v4_3/DeviceCode/Targets/Native/STM32F10x/DeviceCode/drivers/radio/SI4468/si4468_driver.cpp
	CPU_GPIO_EnableOutputPin(SI4468_HANDLE_INTERRUPT_TX, TRUE);
	CPU_GPIO_SetPinState( SI4468_HANDLE_INTERRUPT_TX, FALSE );
	CPU_GPIO_EnableOutputPin(SI4468_HANDLE_INTERRUPT_RX, TRUE);
	CPU_GPIO_SetPinState( SI4468_HANDLE_INTERRUPT_RX, FALSE );
	CPU_GPIO_EnableOutputPin(SI4468_HANDLE_CCA, TRUE);
	CPU_GPIO_SetPinState( SI4468_HANDLE_CCA, FALSE );
	CPU_GPIO_EnableOutputPin(SI4468_HANDLE_SLEEP, TRUE);
	CPU_GPIO_SetPinState( SI4468_HANDLE_SLEEP, FALSE );
	CPU_GPIO_EnableOutputPin(DATARX_SEND_SW_ACK, TRUE);
	CPU_GPIO_SetPinState( DATARX_SEND_SW_ACK, FALSE );
	CPU_GPIO_EnableOutputPin(SI4468_MEASURE_RX_TIME, TRUE);
	CPU_GPIO_SetPinState( SI4468_MEASURE_RX_TIME, FALSE );

	// Set up debugging output
	si446x_set_debug_print(si446x_debug_print, si4468x_debug_level);
	si446x_debug_print(DEBUG02, "SI446X: si446x_hal_init()\r\n");

	if ( owner = si446x_spi_lock(radio_lock_init) ) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_init() FAIL, SPI busy: %s\r\n", print_lock(owner));
		return DS_Fail;
	}

	choose_hardware_config(am_i_wwf(), &SI446X_pin_setup);

	// Default settings
	//softwareACKSent = true;
	si446x_channel = si446x_default_channel;
	tx_power = si446x_default_power;
	tx_msg_ptr = &tx_msg;
	rx_msg_ptr = &rx_msg;
	initSPI2();
	init_si446x_pins();

	si446x_reset();
	reset_errors  = si446x_part_info();
	reset_errors += si446x_func_info();
	si446x_get_int_status(0x0, 0x0, 0x0); // Saves status and clears all interrupts
	si446x_request_device_state();
	si446x_debug_print(DEBUG01, "SI446X: Radio Interrupts Cleared\r\n");

	temp = si446x_get_property(0x00, 0x01, 0x03);
	if (temp != RF_GLOBAL_CONFIG_1_1) {
		si446x_debug_print(ERR99, "SI446X: si446x_hal_init GLOBAL_CONFIG Setting Looks Wrong... Overriding...\r\n");
		si446x_set_property( 0x00, 0x01, 0x03, RF_GLOBAL_CONFIG_1_1 );
	}

	temp = si446x_get_property(0x12, 0x01, 0x08);
	if (temp != PKT_LEN) {
		si446x_debug_print(ERR99, "SI446X: si446x_hal_init PKT_LEN Setting Looks Wrong...Overriding...\r\n");
		si446x_set_property( 0x12, 0x01, 0x08, PKT_LEN );
	}

	temp = si446x_get_property(0x12, 0x01, 0x12);
	if (temp != PKT_FIELD_2_LENGTH) {
		si446x_debug_print(ERR99, "SI446X: si446x_hal_init PKT_FIELD_2_LENGTH Setting Looks Wrong...Overriding...\r\n");
		si446x_set_property( 0x12, 0x01, 0x12, PKT_FIELD_2_LENGTH );
	}

	si446x_fifo_info(0x3); // Reset both FIFOs. bit1 RX, bit0 TX
	si446x_debug_print(DEBUG01, "SI446X: Radio RX/TX FIFOs Cleared\r\n");

	isInit = 1;

	if ( reset_errors ) {
		ret = DS_Fail;
		si446x_debug_print(ERR100, "SI446X: si446x_hal_init(): reset failed.\r\n");
		goto si446x_hal_init_CLEANUP;
	}

	// Set MAC datastructures
	active_mac_index = radio_si446x_spi2.GetMacIdIndex();
	if(radio_si446x_spi2.Initialize(event_handler, mac_id) != DS_Success) {
		ret = DS_Fail;
		si446x_debug_print(ERR100, "SI446X: si446x_hal_init(): MAC init failed.\r\n");
		goto si446x_hal_init_CLEANUP;
	}

	{
		//Get cpu serial and hash it to use as node id. THIS IS NOT A DRIVER FUNCTION. MOVE TO MAC LAYER.
		UINT8 cpuserial[serial_size];
		memset(cpuserial, 0, serial_size);
		GetCPUSerial(cpuserial, serial_size);
		UINT16 tempNum=0;
		UINT16 * temp = (UINT16 *) cpuserial;
		for (int i=0; i< 6; i++){
			tempNum=tempNum ^ temp[i]; //XOR 72-bit number to generate 16-bit hash
		}
		radio_si446x_spi2.SetAddress(tempNum);
		si446x_debug_print(DEBUG02, "SI446X: CPU Serial Hash: 0x%.4X\r\n", tempNum);
	}

	// Init Continuations and interrupts
	// Leave these last in case something above fails.
	CPU_GPIO_EnableInputPin( SI446X_pin_setup.nirq_mf_pin, FALSE, si446x_spi2_handle_interrupt, GPIO_INT_EDGE_LOW, RESISTOR_DISABLED);
	tx_callback_continuation.InitializeCallback(tx_cont_do, NULL);
	rx_callback_continuation.InitializeCallback(rx_cont_do, NULL);
	int_defer_continuation.InitializeCallback(int_cont_do, NULL);

si446x_hal_init_CLEANUP:

	si446x_radio_unlock();
	si446x_spi_unlock();

	return ret;
}

// Hard radio shut-off. Does not check busy.
// This will ALWAYS shut down the radio regardless of MAC level status.
// TODO: Fix above.
DeviceStatus si446x_hal_uninitialize(UINT8 radio) {
	DeviceStatus ret = DS_Success;
	radio_lock_id_t owner;
	si446x_debug_print(DEBUG02, "SI446X: si446x_hal_uninitialize()\r\n");
	
	if ( owner = si446x_spi_lock(radio_lock_uninit) ) 	{ return DS_Fail; }
	if ( !isInit )				{ si446x_spi_unlock(); return DS_Fail; }
	
	isInit = 0;
	radio_shutdown(1);

	CPU_GPIO_DisablePin(SI446X_pin_setup.nirq_mf_pin, RESISTOR_DISABLED, 0, GPIO_ALT_PRIMARY); // Only PIN matters
	radio_si446x_spi2.SetInitialized(FALSE);
	ASSERT((active_mac_index & 0xFF00) == 0); // ??? copied from RF231 driver

	rx_callback = NULL;
	tx_callback = NULL;

	if(radio_si446x_spi2.UnInitialize((UINT8)active_mac_index) != DS_Success) {
		si446x_debug_print(ERR100, "SI446X: si446x_hal_uninitialize(): MAC UnInit failed.\r\n");
		ret = DS_Fail;
	}

	si446x_radio_unlock();
	si446x_spi_unlock();

	return ret;
}

// A full-stop reset of the chip. In the PAL API but you probably shouldn't be.
// Prefer to use UnInit() and Init() instead. --NPS
DeviceStatus si446x_hal_reset(UINT8 radio) {
	radio_lock_id_t owner;

	si446x_debug_print(ERR99, "SI446X: si446x_hal_reset(). PROBABLY A BAD IDEA. USE UNINIT() AND INIT() INSTEAD.\r\n");

	if ( owner = si446x_spi_lock(radio_lock_reset) ) 	{ return DS_Fail; }

	si446x_reset();
	si446x_get_int_status(0x0, 0x0, 0x0); // Clear all interrupts.
	si446x_fifo_info(0x3); // Reset both FIFOs. bit1 RX, bit0 TX

	return DS_Success;
}

// Probably should not be in the driver...
UINT16 si446x_hal_get_address(UINT8 radio) {
	si446x_debug_print(DEBUG01, "SI446X: si446x_hal_get_address()\r\n");
	return radio_si446x_spi2.GetAddress();
}

// Probably should not be in the driver...
BOOL si446x_hal_set_address(UINT8 radio, UINT16 address) {
	si446x_debug_print(DEBUG01, "SI446X: si446x_hal_set_address()\r\n");
	return radio_si446x_spi2.SetAddress(address);
}

// INTERNAL USE ONLY -- CALLER MUST HOLD SPI_LOCK AND RADIO_LOCK
// Caller passes in their lock id, verified in function.
// Returns 'true' if abort with possible packet recovery.
static bool si446x_leave_rx(radio_lock_id_t id) {
	uint8_t int_enable;
	si_state_t state;
	unsigned timeout=si446x_tx_timeout;

	ASSERT(id == spi_lock);
	ASSERT(id == radio_lock);
	if (id != spi_lock || id != radio_lock) {
		si446x_debug_print(ERR100, "SI446X: si446x_leave_rx() Calling with bad locks. Abort\r\n");
		return true;
	}

	state = si446x_request_device_state();
	if (state != SI_STATE_RX && state != SI_STATE_RX_TUNE) return false; // Nothing to do

	int_enable = si446x_get_property(0x01, 1, 0); 		// save interrupt mask
	si446x_set_property(0x01, 1, 0, 0); 				// Writes 0, mask all interrupts

	// Check one last time
	si446x_get_int_status(0xFF, 0xFF, 0xFF); 			// Refresh interrupts does NOT clear.
	if (si446x_get_ph_pend() || si446x_get_modem_pend() || cont_busy()) {
		si446x_set_property(0x01, 1, 0, int_enable); 	// Unmask interrupts
		si446x_debug_print(DEBUG02, "SI446X: si446x_leave_rx() Caught Event before TX attempt. Aborting.\r\n");
		return true;
	}

