Samraksh/eMote/MicroFrameworkPK_v4_3/DeviceCode/Targets/Native/STM32F10x/DeviceCode/drivers/radio/SI4468/si4468_driver.cpp
	// Past this point, any RX that comes in is kill

	si446x_change_state(SI_STATE_SPI_ACTIVE);
	while( si446x_request_device_state() != SI_STATE_SPI_ACTIVE && timeout-- ) ; // spin

	ASSERT(timeout);
	if (timeout == 0)
		si446x_debug_print(ERR100, "SI446X: si446x_leave_rx() State Change Timeout. Radio state unknown!\r\n");

	// The only thing that could maybe have happened is an RX, but its dead to us now.
	si446x_get_int_status(0x0, 0x0, 0x0);			// Clear interrupts
	si446x_fifo_info(0x3);							// Clears FIFO
	si446x_set_property(0x01, 1, 0, int_enable); 	// Unmasks interrupts

	// For debug purposes. The packet is gone.
	if (si446x_get_ph_pend() || si446x_get_modem_pend()) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_leave_rx() Lost packet in RX-TX transition.\r\n");
	}

	return false;
}

// eventTime is ignored unless doTS (USE_TIMESTAMP) is set.
DeviceStatus si446x_packet_send(uint8_t chan, uint8_t *pkt, uint8_t len, UINT32 eventTime, int doTS, uint8_t after_state) {
	uint8_t tx_buf[si446x_packet_size+1]; // Add one for packet size field
	radio_lock_id_t owner;
	si_state_t state = SI_STATE_ERROR;

	si446x_debug_print(DEBUG02, "SI446X: si446x_packet_send() size:%d doTs:%d\r\n", len, doTS);
	si446x_debug_print(DEBUG01, "\tcontents: %s\r\n", (char *)pkt);

	SI446x_INT_MODE_CHECK();

	if ( len > si446x_packet_size || (doTS && (len > si446x_payload_ts)) ) {
		si446x_debug_print(ERR99, "SI446X: si446x_packet_send() Fail. Packet Too Large.\r\n");
		return DS_Timeout; // Cheating here. Not really a timeout but up a layer will return NO_BadPacket. TODO: Make proper.
	}

	if ( !isInit ) {
		si446x_debug_print(ERR99, "SI446X: si446x_packet_send() Fail. Not initialized.\r\n");
		return DS_Fail;
	}

	if ( owner = si446x_spi_lock(radio_lock_tx) ) 	{
		si446x_debug_print(DEBUG02, "SI446X: si446x_packet_send() Fail. SPI locked by %s.\r\n", print_lock(owner));
		return DS_Busy;
	}

	// Lock radio until TX is done.
	if ( owner = si446x_radio_lock(radio_lock_tx) ) 	{
		si446x_debug_print(DEBUG02, "SI446X: si446x_packet_send() Fail. Radio locked by %s\r\n", print_lock(owner));
		si446x_spi_unlock();
		return DS_Busy;
	}

	// Last chance for packets to come in.
	if ( si446x_leave_rx(radio_lock_tx) ) {
		si446x_radio_unlock();
		si446x_spi_unlock();
		return DS_Busy;
	}

	state = si446x_request_device_state();
	if (state == SI_STATE_ERROR) {
		ASSERT(0);
		si446x_debug_print(DEBUG02, "SI446X: si446x_packet_send(): Bad State. Aborting. Reset radio?\r\n");
		si446x_radio_unlock();
		si446x_spi_unlock();
		return DS_Fail;
	}

	tx_buf[0] = len;
	if (doTS) { tx_buf[0] += 4; } // Add timestamp to packet size if used.
	memcpy(&tx_buf[1], pkt, len);

	si446x_write_tx_fifo(len+1, tx_buf); // add one for packet size

	if (doTS) { // Timestamp Case
		GLOBAL_LOCK(irq);

		si446x_change_state(SI_STATE_TX_TUNE);
		while( si446x_request_device_state() != SI_STATE_TX_TUNE ) ; // spin. TODO: Add timeout.

		UINT32 eventOffset = (HAL_Time_CurrentTicks() & 0xFFFFFFFF) - eventTime;

		si446x_write_tx_fifo(4, (uint8_t*)&eventOffset); // generate and write timestamp late as possible.
		si446x_start_tx(chan, after_state, tx_buf[0]+1);
		irq.Release();
	} else { // Normal Case
		si446x_start_tx(chan, after_state, tx_buf[0]+1);
	}

	si446x_spi_unlock();
	// RADIO STAYS LOCKED UNTIL TX DONE

	return DS_Success;
}

void *si446x_hal_send(UINT8 radioID, void *msg, UINT16 size) {
	si446x_debug_print(DEBUG02, "SI446X: si446x_hal_send()\r\n");

	DeviceStatus ret;

	/*if(!softwareACKSent){
		return NULL;
	}*/

	// Do the send
	ret = si446x_packet_send(si446x_channel, (uint8_t *) msg, size, 0, NO_TIMESTAMP, SI446x_TX_DONE_STATE);
	if (ret != DS_Success) {
		SendAckFuncPtrType AckHandler = radio_si446x_spi2.GetMacHandler(active_mac_index)->GetSendAckHandler();
		switch (ret) {
			case DS_Busy: 	(*AckHandler)(tx_msg_ptr, size, NetworkOperations_Busy, SI_DUMMY);			break;
			case DS_Timeout:(*AckHandler)(tx_msg_ptr, size, NetworkOperations_BadPacket, SI_DUMMY); 	break;
			default:		(*AckHandler)(tx_msg_ptr, size, NetworkOperations_Fail, SI_DUMMY); 		break;
		}
		return msg;
	}

	// exchange bags.
	Message_15_4_t* temp = tx_msg_ptr;
	tx_msg_ptr = (Message_15_4_t*) msg;

	return msg;
}

void *si446x_hal_send_ts(UINT8 radioID, void *msg, UINT16 size, UINT32 eventTime) {
	si446x_debug_print(DEBUG02, "SI446X: si446x_hal_send_ts()\r\n");

	DeviceStatus ret;

	/*if(!softwareACKSent){
		return NULL;
	}*/

	// Do the send
	ret = si446x_packet_send(si446x_channel, (uint8_t *) msg, size, eventTime, YES_TIMESTAMP, SI446x_TX_DONE_STATE);
	if (ret != DS_Success) {
		SendAckFuncPtrType AckHandler = radio_si446x_spi2.GetMacHandler(active_mac_index)->GetSendAckHandler();
		switch (ret) {
			case DS_Busy: 	(*AckHandler)(tx_msg_ptr, size, NetworkOperations_Busy, SI_DUMMY);			break;
			case DS_Timeout:(*AckHandler)(tx_msg_ptr, size, NetworkOperations_BadPacket, SI_DUMMY);	break;
			default:		(*AckHandler)(tx_msg_ptr, size, NetworkOperations_Fail, SI_DUMMY);			break;
		}
		return msg;
	}

	// exchange bags.
	Message_15_4_t* temp = tx_msg_ptr;
	tx_msg_ptr = (Message_15_4_t*) msg;

	return msg;
}

#ifdef SI446X_DEBUG_UNFINISHED_PKT
// To debug user reports that SYNC_DET is firing but no "finisher" runs
// "Finisher" would be a CRC error or packet reception.
// ASSUMES YOU HOLD SPI LOCK
static bool rx_consistency_check(void) {
	GLOBAL_LOCK(irq); // lock while debugging only. Change me.

	// If the radio lock is held by RX
	// We must be in either RX mode or the continuation is pending
	// or an interrupt is pending
	if ( radio_lock == radio_lock_rx ) {
		si_state_t state = si446x_request_device_state();
		//bool isBusy = (cont_busy() || radio_get_assert_irq());
		si446x_get_int_status(0xFF, 0xFF, 0xFF);
		bool isBusy = cont_busy() || si446x_get_ph_pend() || si446x_get_modem_pend();

		if (state != SI_STATE_RX && !isBusy) {
			si446x_debug_print(ERR100, "SI446X: rx_consistency_check() Fail? Show Nathan.\r\n");
			ASSERT(0);
			return false;
		}

		// check for timeout of SYNC_DET
		UINT64 now = HAL_Time_CurrentTicks();
		if ( (now - rx_timestamp) > (si446x_rx_timeout_ms*1000) ) {
			si446x_debug_print(ERR100, "SI446X: rx_consistency_check() Timeout? Show Nathan.\r\n");
			ASSERT(0);
			return false;
		}
	}
	return true;
}
#endif // #ifdef SI446X_DEBUG_UNFINISHED_PKT

// Does NOT set the radio busy unless a packet comes in.
DeviceStatus si446x_hal_rx(UINT8 radioID) {
	radio_lock_id_t owner;
	si446x_debug_print(DEBUG02, "SI446X: si446x_hal_rx()\r\n");

	if (!isInit) {
		si446x_debug_print(DEBUG01, "SI446X: si446x_hal_rx() FAIL. Not Init.\r\n");
		return DS_Fail;
	}

	SI446x_INT_MODE_CHECK();

