Samraksh/eMote/MicroFrameworkPK_v4_3/DeviceCode/Targets/Native/STM32F10x/DeviceCode/drivers/radio/SI4468/si4468_driver.cpp
	/*if(!softwareACKSent){
		return DS_Fail;
	}*/

	if ( cont_busy() ) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_rx() Tasks outstanding, aborting.\r\n");
		return DS_Fail;
	}

	if ( owner = si446x_spi_lock(radio_lock_rx_setup) ) {
		si446x_debug_print(DEBUG01, "SI446X: si446x_hal_rx() FAIL. SPI locked by %s\r\n", print_lock(owner));
		return DS_Busy;
	}

#ifdef SI446X_DEBUG_UNFINISHED_PKT
	// DEBUGGING ONLY
	rx_consistency_check();
#endif

	// We have to hold radio lock to ensure we are free
	if ( owner = si446x_radio_lock(radio_lock_rx_setup) ) {
		si446x_debug_print(DEBUG01, "SI446X: si446x_hal_rx() FAIL. Radio locked by %s\r\n", print_lock(owner));
		si446x_spi_unlock();
		return DS_Busy;
	}

	si446x_get_int_status(0xFF, 0xFF, 0xFF);
	if ( radio_get_assert_irq() || cont_busy() || si446x_get_ph_pend() || si446x_get_modem_pend() ) {
		si446x_debug_print(DEBUG01, "SI446X: si446x_hal_rx() radio ops pending, aborting.\r\n");
		si446x_radio_unlock();
		si446x_spi_unlock();
		return DS_Busy;
	}

	// Now that we are sure we aren't busy, can unlock the radio.
	si446x_radio_unlock();

	si446x_start_rx_fast_channel(si446x_channel);
	si446x_spi_unlock();
	return DS_Success;
}


DeviceStatus si446x_hal_sleep(UINT8 radioID) {
	CPU_GPIO_SetPinState( SI4468_HANDLE_SLEEP, TRUE );
	radio_lock_id_t owner;
	DeviceStatus ret;
	si446x_debug_print(DEBUG01, "SI446X: si446x_hal_sleep()\r\n");

	SI446x_INT_MODE_CHECK();

	if (!isInit) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_sleep() FAIL. No Init.\r\n");
		return DS_Fail;
	}

	// We were already asleep
	if ( si446x_request_device_state_shadow() == SI_STATE_SLEEP ) {
		return DS_Success;
	}

	/*if(!softwareACKSent){
		return DS_Fail;
	}*/

	if ( owner = si446x_spi_lock(radio_lock_sleep) ) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_sleep() FAIL. SPI locked. Owner is %s\r\n", print_lock(owner));
		CPU_GPIO_SetPinState( SI4468_HANDLE_SLEEP, FALSE );
		CPU_GPIO_SetPinState( SI4468_HANDLE_SLEEP, TRUE );
		CPU_GPIO_SetPinState( SI4468_HANDLE_SLEEP, FALSE );
		return DS_Fail;
	}

	if ( owner = si446x_radio_lock(radio_lock_sleep) ) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_sleep() FAIL. Radio Busy. Owner is %s\r\n", print_lock(owner));
		si446x_spi_unlock();
		CPU_GPIO_SetPinState( SI4468_HANDLE_SLEEP, FALSE );
		CPU_GPIO_SetPinState( SI4468_HANDLE_SLEEP, TRUE );
		CPU_GPIO_SetPinState( SI4468_HANDLE_SLEEP, FALSE );
		return DS_Fail;
	}

	si446x_get_int_status(0xFF, 0xFF, 0xFF);
	if ( radio_get_assert_irq() || si446x_get_ph_pend() || si446x_get_modem_pend() ) { // Assuming cont_busy() check isn't necessary
		si446x_debug_print(DEBUG01, "SI446X: si446x_hal_sleep() radio interrupts pending, abort sleep.\r\n");
		ret = DS_Busy;
	}
	else { // Radio appears to be idle, sleep is a go
		si446x_change_state(SI_STATE_SLEEP);
		ret = DS_Success;
	}

	si446x_radio_unlock();
	si446x_spi_unlock();

	CPU_GPIO_SetPinState( SI4468_HANDLE_SLEEP, FALSE );
	return ret;
}


DeviceStatus si446x_hal_tx_power(UINT8 radioID, int pwr) {
	radio_lock_id_t owner;
	si446x_debug_print(DEBUG02, "SI446X: si446x_hal_tx_power()\r\n");

	if (pwr < 0) return DS_Fail; // Not worth of a printf

	if ( owner = si446x_spi_lock(radio_lock_tx_power) ) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_tx_power() FAIL. SPI locked: %s\r\n", print_lock(owner));
		return DS_Fail;
	}

	if (!isInit) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_tx_power() FAIL. No Init.\r\n");
		si446x_spi_unlock();
		return DS_Fail;
	}

	if ( owner = si446x_radio_lock(radio_lock_tx_power) ) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_tx_power() FAIL. Radio locked: %s\r\n", print_lock(owner));
		si446x_spi_unlock();
		return DS_Fail;
	}

	si446x_set_property( 0x22 , 1, 0x01, (uint8_t) pwr );
	tx_power = pwr;

	si446x_radio_unlock();
	si446x_spi_unlock();

	return DS_Success;
}

DeviceStatus si446x_hal_set_channel(UINT8 radioID, int channel) {
	radio_lock_id_t owner;
	si446x_debug_print(DEBUG02, "SI446X: si446x_hal_set_channel()\r\n");
	if (channel < 0 ) return DS_Fail;

	if ( owner = si446x_spi_lock(radio_lock_set_channel) ) {
		si446x_debug_print(DEBUG01, "SI446X: si446x_hal_set_channel() FAIL. SPI locked: %s\r\n", print_lock(owner));
		return DS_Fail;
	}

	if (!isInit) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_set_channel() FAIL. No Init.\r\n");
		si446x_spi_unlock();
		return DS_Fail;
	}

	if ( owner = si446x_radio_lock(radio_lock_set_channel) ) {
		si446x_debug_print(DEBUG01, "SI446X: si446x_hal_set_channel() FAIL. Radio Busy: %s\r\n", print_lock(owner));
		si446x_spi_unlock();
		return DS_Fail;
	}

	si446x_channel = channel;

	// Technically may not need the locks.
	// But could confuse the user otherwise.
	// And still at least protects the vars.
	si446x_radio_unlock();
	si446x_spi_unlock();

	return DS_Success;
}


// Doesn't belong in radio driver... --NPS
//Properties of radio
static INT8 radioType;
void si446x_hal_set_RadioType(INT8 radio)
{
	radioType = radio;
}

// Doesn't belong in radio driver...
INT8 si446x_hal_get_RadioType()
{
	return radioType;
}

DeviceStatus si446x_hal_cca_ms(UINT8 radioID, UINT32 ms) {
	CPU_GPIO_SetPinState( SI4468_HANDLE_CCA, TRUE );
	radio_lock_id_t owner;
	si446x_debug_print(DEBUG02, "SI446X: si446x_hal_cca_ms() ms:%d\r\n",ms);

	DeviceStatus ret;

	SI446x_INT_MODE_CHECK();

	if (!isInit) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_cca_ms() FAIL. No Init.\r\n");
		return DS_Fail;
	}

	/*if(!softwareACKSent){
		return DS_Fail;
	}*/

	if ( owner = si446x_spi_lock(radio_lock_cca_ms) ) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_cca_ms() FAIL. SPI locked: %s\r\n", print_lock(owner));
		return DS_Fail;
	}

	if ( owner = si446x_radio_lock(radio_lock_cca_ms) ) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_cca_ms() FAIL. Radio locked: %s\r\n", print_lock(owner));
		si446x_spi_unlock();
		return DS_Fail;
	}

	if ( cont_busy() ) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_cca_ms() FAIL. Continuation Pending.\r\n");
		si446x_radio_unlock();
		si446x_spi_unlock();
		return DS_Fail;
	}

	si_state_t state = si446x_request_device_state();

	// Check for bad state while we're at it.
	if (state == SI_STATE_TX || state == SI_STATE_TX_TUNE || state == SI_STATE_ERROR) {
		si446x_debug_print(ERR100, "SI446X: si446x_hal_cca_ms(): Warning, impossible state.\r\n");
		si446x_radio_unlock();
		si446x_spi_unlock();
		return DS_Fail;
	}

