Samraksh/eMote/MicroFrameworkPK_v4_3/DeviceCode/Targets/Native/STM32F10x/DeviceCode/drivers/radio/SI4468/si4468_driver.cpp
	// If radio is already in RX, stay in RX.
	// If a packet comes in, shouldn't lose it, but RX processing will be defered and timestamp will be wrong.
	if ( state == SI_STATE_RX_TUNE || state == SI_STATE_RX ) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_cca_ms(): CCA request during normal RX; State is: %d\r\n", state);
		while (state == SI_STATE_RX_TUNE) { state = si446x_request_device_state(); }
		HAL_Time_Sleep_MicroSeconds(ms);
		si446x_get_modem_status( 0xFF );

		if (si446x_get_current_rssi() >= si446x_rssi_cca_thresh)
			ret = DS_Busy;
		else
			ret = DS_Success;

		si446x_radio_unlock();
		si446x_spi_unlock();
		return ret;
	}

	// Otherwise we were asleep and need to stay asleep
	uint8_t int_enable;
	int_enable = si446x_get_property(0x01, 1, 0); 	// save interrupt states
	si446x_set_property(0x01, 1, 0, 0); 			// Writes 0, disables all interrupts

	si446x_get_int_status(0xFF, 0xFF, 0xFF); 		// Check interrupts, does NOT clear.

	// Check one last time to see if anything happened.
	// A packet cannot have come in since RX case is covered above, so this should be rare, maybe never.
	if (radio_get_assert_irq() || si446x_get_ph_pend() || si446x_get_modem_pend() ) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_cca_ms(): Radio not idle, aborting CCA\r\n");
		si446x_set_property(0x01, 1, 0, int_enable); 	// Re-enables interrupts
		si446x_radio_unlock();
		si446x_spi_unlock();
		return DS_Fail;
	}

	si446x_start_rx_fast_channel(si446x_channel);
	while (state != SI_STATE_RX) { state = si446x_request_device_state(); }
	HAL_Time_Sleep_MicroSeconds(ms);
	si446x_get_modem_status( 0xFF );
	if (si446x_get_current_rssi() >= si446x_rssi_cca_thresh)
		ret = DS_Busy;
	else
		ret = DS_Success;

	si446x_change_state(SI_STATE_SPI_ACTIVE); 		// disables RX
	si446x_get_int_status(0x0, 0x0, 0x0);	 		// Clear interrupts
	si446x_fifo_info(0x3); 							// Clear FIFO in case we caught something.
	si446x_set_property(0x01, 1, 0, int_enable); 	// Re-enables interrupts
	si446x_change_state(SI_STATE_SLEEP); 			// All done, sleep.

	si446x_radio_unlock();
	si446x_spi_unlock();

	CPU_GPIO_SetPinState( SI4468_HANDLE_CCA, FALSE );
	return ret;
}

UINT32 si446x_hal_get_chan(UINT8 radioID) {
	si446x_debug_print(DEBUG02, "SI446X: si446x_hal_get_chan()\r\n");
	return si446x_channel;
}


UINT32 si446x_hal_get_power(UINT8 radioID) {
	si446x_debug_print(DEBUG02, "SI446X: si446x_hal_get_power()\r\n");
	return tx_power;
}

// Also possible to do this with FRR.
// Automatically saved each packet, don't need to bother radio or lock.
UINT32 si446x_hal_get_rssi(UINT8 radioID) {
	UINT32 ret = si446x_get_latched_rssi();
	si446x_debug_print(DEBUG02, "SI446X: si446x_hal_get_rssi() : %d\r\n", ret);
	return ret;
}

// INTERRUPT CONTEXT, LOCKED
static void si446x_pkt_tx_int() {
	CPU_GPIO_SetPinState( SI4468_HANDLE_INTERRUPT_TX, TRUE );
	si446x_debug_print(DEBUG02, "SI446X: si446x_pkt_tx_int()\r\n");
	//if(softwareACKSent){
	if(NEED_SI4468_CONTINUATION){
		tx_callback_continuation.Enqueue();
	}
	else{
		tx_cont_do(NULL);
	}
	//}
	CPU_GPIO_SetPinState( SI4468_HANDLE_INTERRUPT_TX, FALSE );
}

// INTERRUPT CONTEXT. LOCKED, radio_busy until we pull from continuation
static void si446x_pkt_rx_int() {
	// radio_lock owned by SYNC_DET at this point
	CPU_GPIO_SetPinState( SI4468_HANDLE_INTERRUPT_RX, TRUE );
	si446x_debug_print(DEBUG01, "SI446X: si446x_pkt_rx_int()\r\n");
	//if(softwareACKSent){
		//softwareACKSent = false;
	if(NEED_SI4468_CONTINUATION){
		rx_callback_continuation.Enqueue();
	}
	else{
		rx_cont_do(NULL);
	}
	//}
	CPU_GPIO_SetPinState( SI4468_HANDLE_INTERRUPT_RX, FALSE );
}

// ASSUMES SPI_LOCK IS HELD BY CALLER (INTERRUPT HANDLER)
// Interface spec is to just to drop the packet on the floor
static void si446x_pkt_bad_crc_int(void) {
	radio_lock_id_t owner 		= (radio_lock_id_t) spi_lock;
	radio_lock_id_t radio_owner = (radio_lock_id_t) radio_lock;

	ASSERT(owner == radio_lock_interrupt);
	if (owner != radio_lock_interrupt) {
		si446x_debug_print(ERR99, "SI446X: si446x_pkt_bad_crc_int() Bad spi_lock!, owner: %s\r\n", print_lock(owner));
		return;
	}

	ASSERT(radio_owner == radio_lock_rx);
	if (radio_owner != radio_lock_rx) {
		si446x_debug_print(ERR99, "SI446X: si446x_pkt_bad_crc_int() Bad radio_lock!, owner: %s\r\n", print_lock(radio_owner));
		return;
	}

	si446x_debug_print(DEBUG01, "SI446X: si446x_pkt_bad_crc_int() Bad CRC. FIFOs cleared\r\n");
	si446x_fifo_info(0x3); 		// clear the FIFO
	// We lost the packet, so give up the radio
	si446x_radio_unlock();
}

// INTERRUPT CONTEXT
static void si446x_spi2_handle_interrupt(GPIO_PIN Pin, BOOL PinState, void* Param)
{
	unsigned modem_pend, ph_pend;
	radio_lock_id_t owner;
	UINT64 int_ts;

	GLOBAL_LOCK(irq); // Locked due to time critical.
	int_ts = HAL_Time_CurrentTicks(); // Log RX time.
	irq.Release(); // Unlock after timestamp.

	if (Pin != SI446X_pin_setup.nirq_mf_pin) { return; }

	si446x_debug_print(DEBUG01, "SI446X: INT\r\n");

	if ( owner = si446x_spi_lock(radio_lock_interrupt) ) {
		// Damn, we got an interrupt in the middle of another transaction. Have to defer it.
		// Hope this doesn't happen much because will screw up timestamp.
		// TODO: Spend some effort to mitigate this if/when it happens.
		si446x_debug_print(ERR99, "SI446X: si446x_spi2_handle_interrupt() SPI locked: %s\r\n", print_lock(owner));
		int_defer = true;
		int_defer_continuation.Enqueue();
		return;
	}

	int_defer = false;

	si446x_get_int_status(0x0, 0x0, 0x0); // Saves status and clears all interrupts
	ph_pend			= si446x_get_ph_pend();
	modem_pend 		= si446x_get_modem_pend();

	// Only save timestamp if it was an RX event.
	// Unlock SPI after the potential radio_lock, so both don't glitch free.
	if (modem_pend & MODEM_MASK_SYNC_DETECT) {
		// Unconditional lock grab.
		owner = si446x_radio_lock_nofail(radio_lock_rx);
		if (owner != radio_lock_none && owner != radio_lock_tx)
			si446x_debug_print(ERR99, "SI446X: si446x_spi2_handle_interrupt() Odd radio_lock: %s\r\n", print_lock(owner));
		rx_timestamp = int_ts;
	}

	if (ph_pend & PH_STATUS_MASK_PACKET_RX) 	{ finisher_queued = true; si446x_pkt_rx_int(); }
	if (ph_pend & PH_STATUS_MASK_PACKET_SENT) 	{ si446x_pkt_tx_int(); }
	if (ph_pend & PH_STATUS_MASK_CRC_ERROR) 	{ si446x_pkt_bad_crc_int(); }

	// If we finished a packet, go to sleep
	if ( (ph_pend & PH_STATUS_MASK_PACKET_RX) || (ph_pend & PH_STATUS_MASK_CRC_ERROR) ) {
		si446x_change_state(SI_STATE_SLEEP);
	}

	si446x_spi_unlock();
}
